ITHACA-FV/tutorials/NN/01simpleTurbGeomClosed/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];
oriented        oriented;


internalField   nonuniform List<scalar> 
27720
(
0.0025
0
0.0025
0
0.0025
0
0.0025
0
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform -0.0025;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.000916667
0.000916667
0.000916667
0.000916667
0.000916667
0.000916667
0.000916667
0.000916667
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
    frontAndBackLow
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    step
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
